setup/project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-24 Thu 23:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/rpm.frontend/styles.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga83bf20">1. Setup</a>
<ul>
<li><a href="#orgb8d709c">1.1. Git ignore</a></li>
<li><a href="#orgf501f76">1.2. Editor config</a></li>
<li><a href="#org7174c89">1.3. Zprint</a></li>
<li><a href="#org3a97ea8">1.4. CLJ Kondo</a></li>
<li><a href="#org1e42604">1.5. Package.json</a></li>
</ul>
</li>
<li><a href="#org989be3e">2. Shadow CLJS</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga83bf20" class="outline-2">
<h2 id="orga83bf20"><span class="section-number-2">1</span> Setup</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb8d709c" class="outline-3">
<h3 id="orgb8d709c"><span class="section-number-3">1.1</span> Git ignore</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Org mode files are the single source of truth. Hence we don't need to check the generated files in the source control.
</p>

<p>
The only files that we do need to keep is <code>yarn.lock</code>, since it's generated and necessary to keep track of the exact versions of libraries we're using and <code>.github</code>, so GitHub knows how to run the tests.
</p>

<p>
With that said the GitHub workflow is also generated. See the chapter on <a href="./testing.html">testing</a>.
</p>

<div class="org-src-container">
<pre class="src src-gitignore">*
!**/*.org
</pre>
</div>

<p>
By the way have you noticed that this <code>.gitignore</code> ignores itself?
</p>
</div>
</div>

<div id="outline-container-orgf501f76" class="outline-3">
<h3 id="orgf501f76"><span class="section-number-3">1.2</span> Editor config</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://editorconfig.org">https://editorconfig.org</a>
</p>

<div class="org-src-container">
<pre class="src src-editorconfig">root = true

# Unix-style newlines with a newline ending every file
[*]
end_of_line = lf
insert_final_newline = true
charset = utf-8
indent_style = space
indent_size = 2
trim_trailing_whitespace = true
</pre>
</div>
</div>
</div>

<div id="outline-container-org7174c89" class="outline-3">
<h3 id="org7174c89"><span class="section-number-3">1.3</span> Zprint</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-clojure">{<span style="color: #008b8b;">:style</span> <span style="color: #008b8b;">:indent-only</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a97ea8" class="outline-3">
<h3 id="org3a97ea8"><span class="section-number-3">1.4</span> CLJ Kondo</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-clojure">{<span style="color: #008b8b;">:lint-as</span> {<span style="color: #228b22;">devcards.core</span>/defcard <span style="color: #228b22;">cljs.core</span>/def
          <span style="color: #228b22;">devcards.core</span>/deftest <span style="color: #228b22;">cljs.core</span>/def}}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e42604" class="outline-3">
<h3 id="org1e42604"><span class="section-number-3">1.5</span> Package.json</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-javascript">{
  <span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"rpm"</span>,
  <span style="color: #8b2252;">"version"</span>: <span style="color: #8b2252;">"0.1.0"</span>,
  <span style="color: #8b2252;">"private"</span>: <span style="color: #008b8b;">true</span>,
  <span style="color: #8b2252;">"scripts"</span>: {
    <span style="color: #8b2252;">"sc"</span>: <span style="color: #8b2252;">"shadow-cljs"</span>,
    <span style="color: #8b2252;">"server"</span>: <span style="color: #8b2252;">"shadow-cljs stop &amp;&amp; shadow-cljs start"</span>,
    <span style="color: #8b2252;">"start"</span>: <span style="color: #8b2252;">"shadow-cljs watch app"</span>,
    <span style="color: #8b2252;">"cards"</span>: <span style="color: #8b2252;">"shadow-cljs watch cards"</span>,
    <span style="color: #8b2252;">"build"</span>: <span style="color: #8b2252;">"yarn clean &amp;&amp; shadow-cljs release app"</span>,
    <span style="color: #8b2252;">"test"</span>: <span style="color: #8b2252;">"shadow-cljs compile test &amp;&amp; node out/test.js"</span>,
    <span style="color: #8b2252;">"test:watch"</span>: <span style="color: #8b2252;">"shadow-cljs watch test --config-merge \"{:autorun true}\""</span>,
    <span style="color: #8b2252;">"e2e"</span>: <span style="color: #8b2252;">"shadow-cljs compile e2e &amp;&amp; node out/e2e.js"</span>,
    <span style="color: #8b2252;">"report"</span>: <span style="color: #8b2252;">"shadow-cljs run shadow.cljs.build-report app report.html"</span>,
    <span style="color: #8b2252;">"lint"</span>: <span style="color: #8b2252;">"clj-kondo --lint src"</span>,
    <span style="color: #8b2252;">"format"</span>: <span style="color: #8b2252;">"zprint-clj --hang -i \"./src/**/*.{clj,cljs,cljc,edn}\" -o ./ &amp;&amp; zprint-clj -i \"./*.edn\" -o ./"</span>,
    <span style="color: #8b2252;">"clean"</span>: <span style="color: #8b2252;">"rimraf public/js"</span>
  },
  <span style="color: #8b2252;">"devDependencies"</span>: {
    <span style="color: #8b2252;">"@testing-library/dom"</span>: <span style="color: #8b2252;">"^7.19.0"</span>,
    <span style="color: #8b2252;">"@testing-library/react"</span>: <span style="color: #8b2252;">"^10.4.3"</span>,
    <span style="color: #8b2252;">"clj-kondo"</span>: <span style="color: #8b2252;">"2020.11.7"</span>,
    <span style="color: #8b2252;">"highlight.js"</span>: <span style="color: #8b2252;">"10.1.1"</span>,
    <span style="color: #8b2252;">"jsdom"</span>: <span style="color: #8b2252;">"^16.2.2"</span>,
    <span style="color: #8b2252;">"jsdom-global"</span>: <span style="color: #8b2252;">"^3.0.2"</span>,
    <span style="color: #8b2252;">"marked"</span>: <span style="color: #8b2252;">"^1.1.0"</span>,
    <span style="color: #8b2252;">"rimraf"</span>: <span style="color: #8b2252;">"~3.0.2"</span>,
    <span style="color: #8b2252;">"serve-handler"</span>: <span style="color: #8b2252;">"~6.1.3"</span>,
    <span style="color: #8b2252;">"shadow-cljs"</span>: <span style="color: #8b2252;">"~2.10.13"</span>,
    <span style="color: #8b2252;">"taiko"</span>: <span style="color: #8b2252;">"~1.0.12"</span>,
    <span style="color: #8b2252;">"taiko-diagnostics"</span>: <span style="color: #8b2252;">"~0.4.0"</span>,
    <span style="color: #8b2252;">"zprint-clj"</span>: <span style="color: #8b2252;">"~0.8.0"</span>
  },
  <span style="color: #8b2252;">"dependencies"</span>: {
    <span style="color: #8b2252;">"create-react-class"</span>: <span style="color: #8b2252;">"~15.6.3"</span>,
    <span style="color: #8b2252;">"react"</span>: <span style="color: #8b2252;">"~16.8.0"</span>,
    <span style="color: #8b2252;">"react-dom"</span>: <span style="color: #8b2252;">"~16.8.0"</span>
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org989be3e" class="outline-2">
<h2 id="org989be3e"><span class="section-number-2">2</span> Shadow CLJS</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-clojure">{<span style="color: #008b8b;">:builds</span>
{<span style="color: #008b8b;">:app</span> {<span style="color: #008b8b;">:asset-path</span> <span style="color: #8b2252;">"/js"</span>
        <span style="color: #008b8b;">:modules</span> {<span style="color: #008b8b;">:main</span> {<span style="color: #008b8b;">:init-fn</span> <span style="color: #228b22;">app.core</span>/main}}
        <span style="color: #008b8b;">:output-dir</span> <span style="color: #8b2252;">"public/js"</span>
        <span style="color: #008b8b;">:target</span> <span style="color: #008b8b;">:browser</span>}
  <span style="color: #008b8b;">:cards</span> {<span style="color: #008b8b;">:asset-path</span> <span style="color: #8b2252;">"/js"</span>
          <span style="color: #008b8b;">:modules</span> {<span style="color: #008b8b;">:main</span> {<span style="color: #008b8b;">:init-fn</span> <span style="color: #228b22;">app.cards</span>/main}}
          <span style="color: #008b8b;">:compiler-options</span> {<span style="color: #008b8b;">:devcards</span> <span style="color: #008b8b;">true</span>}
          <span style="color: #008b8b;">:output-dir</span> <span style="color: #8b2252;">"public/js"</span>
          <span style="color: #008b8b;">:target</span> <span style="color: #008b8b;">:browser</span>}
  <span style="color: #008b8b;">:test</span> {<span style="color: #008b8b;">:ns-regexp</span> <span style="color: #8b2252;">"app.cards"</span>
        <span style="color: #008b8b;">:output-to</span> <span style="color: #8b2252;">"out/test.js"</span>
        <span style="color: #008b8b;">:target</span> <span style="color: #008b8b;">:node-test</span>}
  <span style="color: #008b8b;">:e2e</span> {<span style="color: #008b8b;">:ns-regexp</span> <span style="color: #8b2252;">"e2e.*"</span>
        <span style="color: #008b8b;">:output-to</span> <span style="color: #8b2252;">"out/e2e.js"</span>
        <span style="color: #008b8b;">:target</span> <span style="color: #008b8b;">:node-test</span>}}
<span style="color: #008b8b;">:dependencies</span> [[reagent <span style="color: #8b2252;">"0.8.1"</span>]
                [devcards <span style="color: #8b2252;">"0.2.6"</span>]]
<span style="color: #008b8b;">:jvm-opts</span> [<span style="color: #8b2252;">"-Xmx600m"</span>] <span style="color: #b22222;">; Give JVM more memory.</span>
<span style="color: #008b8b;">:dev-http</span> {8000 <span style="color: #8b2252;">"public"</span>}
<span style="color: #008b8b;">:nrepl</span> {<span style="color: #008b8b;">:port</span> 3333}
<span style="color: #008b8b;">:source-paths</span> [<span style="color: #8b2252;">"src"</span>]}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2021-06-24 Thu 23:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
